### Period and period index in pandas

In [1]:
import pandas as pd
import numpy as np

In [3]:
#Getting our yearly period
y=pd.Period('2016')
y

Period('2016', 'A-DEC')

In [4]:
y+1

Period('2017', 'A-DEC')

In [7]:
#Getting our monthly period
m=pd.Period('2016-01',freq='M')
m

Period('2016-01', 'M')

In [8]:
m+1

Period('2016-02', 'M')

In [12]:
#Getting our daily period
d=pd.Period('2017-01-01',freq='D')
d

Period('2017-01-01', 'D')

In [13]:
d+1

Period('2017-01-02', 'D')

In [15]:
#Getting our quarterly period
q=pd.Period('2022',freq='Q-DEC')
q

Period('2022Q1', 'Q-DEC')

In [18]:
#dir(q)
q.start_time

Timestamp('2022-01-01 00:00:00')

In [19]:
q.end_time

Timestamp('2022-03-31 23:59:59.999999999')

In [22]:
idx=pd.period_range('2020',periods=10,freq='Q-DEC')
idx

PeriodIndex(['2020Q1', '2020Q2', '2020Q3', '2020Q4', '2021Q1', '2021Q2',
             '2021Q3', '2021Q4', '2022Q1', '2022Q2'],
            dtype='period[Q-DEC]')

In [23]:
pst=pd.Series(idx)
pst

0    2020Q1
1    2020Q2
2    2020Q3
3    2020Q4
4    2021Q1
5    2021Q2
6    2021Q3
7    2021Q4
8    2022Q1
9    2022Q2
dtype: period[Q-DEC]

In [27]:
ps=np.random.randn(len(idx))
ps

array([ 0.02275752, -2.26043417, -0.05669069, -0.69076578,  0.2429974 ,
       -1.04293259,  1.77493159,  1.32510949, -0.54980547, -1.96505924])

In [28]:
ps=pd.DataFrame(ps)
ps

          0
0  0.022758
1 -2.260434
2 -0.056691
3 -0.690766
4  0.242997
5 -1.042933
6  1.774932
7  1.325109
8 -0.549805
9 -1.965059

In [30]:
ps.set_index(idx,inplace=True)
ps

               0
2020Q1  0.022758
2020Q2 -2.260434
2020Q3 -0.056691
2020Q4 -0.690766
2021Q1  0.242997
2021Q2 -1.042933
2021Q3  1.774932
2021Q4  1.325109
2022Q1 -0.549805
2022Q2 -1.965059

In [31]:
ps.to_timestamp()

                   0
2020-01-01  0.022758
2020-04-01 -2.260434
2020-07-01 -0.056691
2020-10-01 -0.690766
2021-01-01  0.242997
2021-04-01 -1.042933
2021-07-01  1.774932
2021-10-01  1.325109
2022-01-01 -0.549805
2022-04-01 -1.965059

In [33]:
ps.loc['2022']

               0
2022Q1 -0.549805
2022Q2 -1.965059

In [34]:
ps.to_period
ps

               0
2020Q1  0.022758
2020Q2 -2.260434
2020Q3 -0.056691
2020Q4 -0.690766
2021Q1  0.242997
2021Q2 -1.042933
2021Q3  1.774932
2021Q4  1.325109
2022Q1 -0.549805
2022Q2 -1.965059

In [40]:
df=pd.read_csv('wmt.csv')
df

  Line Item  2017Q1  2017Q2  2017Q3  2017Q4  2018Q1
0   Revenue  115904  120854  118179  130936  117452
1  Expenses   86544   89485   87484   97743   87668
2    Profit   29360   29360   30695   33193   29854

Our goal is to transpose the line item to be rows and put revenue,expenses and profit as our columns

In [43]:
df.set_index('Line Item',inplace=True)
df

           2017Q1  2017Q2  2017Q3  2017Q4  2018Q1
Line Item
Revenue    115904  120854  118179  130936  117452
Expenses    86544   89485   87484   97743   87668
Profit      29360   29360   30695   33193   29854

In [46]:
df=df.T
df

Line Item  Revenue  Expenses  Profit
2017Q1      115904     86544   29360
2017Q2      120854     89485   29360
2017Q3      118179     87484   30695
2017Q4      130936     97743   33193
2018Q1      117452     87668   29854

In [47]:
df.index

Index(['2017Q1', '2017Q2', '2017Q3', '2017Q4', '2018Q1'], dtype='object')

In [49]:
df.index=pd.PeriodIndex(df.index,freq='Q-JAN')
df['start date']=df.index.map(lambda x:x.start_time)
df

Line Item  Revenue  Expenses  Profit start date
2017Q1      115904     86544   29360 2016-02-01
2017Q2      120854     89485   29360 2016-05-01
2017Q3      118179     87484   30695 2016-08-01
2017Q4      130936     97743   33193 2016-11-01
2018Q1      117452     87668   29854 2017-02-01

In [50]:
df.index

PeriodIndex(['2017Q1', '2017Q2', '2017Q3', '2017Q4', '2018Q1'], dtype='period[Q-JAN]')

In [52]:
df['end date']=df.index.map(lambda x:x.end_time)
df

Line Item  Revenue  Expenses  Profit start date                      end date
2017Q1      115904     86544   29360 2016-02-01 2016-04-30 23:59:59.999999999
2017Q2      120854     89485   29360 2016-05-01 2016-07-31 23:59:59.999999999
2017Q3      118179     87484   30695 2016-08-01 2016-10-31 23:59:59.999999999
2017Q4      130936     97743   33193 2016-11-01 2017-01-31 23:59:59.999999999
2018Q1      117452     87668   29854 2017-02-01 2017-04-30 23:59:59.999999999